tutorials/incompressible/pimpleFoam/RAS/oscillatingInletACMI2D/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls
    {
        type            zeroGradient;
    }
    couple1
    {
        type            zeroGradient;
    }
    couple2
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    ACMI1_blockage
    {
        type            zeroGradient;
    }
    ACMI1_couple
    {
        type            cyclicACMI;
        value           uniform 0;
    }
    ACMI2_blockage
    {
        type            zeroGradient;
    }
    ACMI2_couple
    {
        type            cyclicACMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
